[
  {
    "id": "1",
    "department": "",
    "role": "Part-time Tutor/Teaching Assistant",
    "summary": "As a Tutor at Timeless Tuition, you will play a pivotal role in shaping the academic success of our students. Your primary responsibility will be to provide individualised and engaging tutoring sessions tailored to the unique needs of a group of students. You will work closely with students from various academic levels, offering support in core subjects such as Mathematics, English, and Science. Your expertise will extend to specialised preparation for exams, including 11+, SATs, GCSE, and A-Level depending on your level of expertise.",
    "description": "As a Tutor at Timeless Tuition, you will play a pivotal role in shaping the academic success of our students. Your primary responsibility will be to provide individualised and engaging tutoring sessions tailored to the unique needs of a group of students. You will work closely with students from various academic levels, offering support in core subjects such as Mathematics, English, and Science. Your expertise will extend to specialised preparation for exams, including 11+, SATs, GCSE, and A-Level depending on your level of expertise.\n### Key Responsibilities:\n- **Individualised Instruction**: Deliver tutoring sessions to meet the needs of each student.\n- **Subject Mastery**: Provide comprehensive support in core subjects, ensuring a deep understanding of fundamental concepts.\n- **Exam Preparation**: Specialize in preparing students for standardised exams, including 11+, GCSE, and A-Level, incorporating effective study strategies and exam techniques.\n- **Progress Monitoring**: Regularly assess and monitor student progress, adjusting teaching methods as needed to enhance understanding.\n- **Motivational Support**: Foster a positive and encouraging learning environment, boosting students' confidence and motivation.\n- **Effective Communication**: Maintain open and effective communication with both students' supervisors and parents, providing feedback on progress and areas for improvement.\n- **Time Management**: effective time management and organisational skills responsibilities.\n### Qualifications and Skills:\n- Our required GCSE grades in core subjects\n- Excellent communication and interpersonal skills.\n- Ability to adapt teaching methods to accommodate various learning styles.\n- Detail-oriented with a passion for fostering a positive and supportive learning environment.",
    "experience": "",
    "salary": "Competitive",
    "employmentType": "Part-time",
    "location": "Watford",
    "closingDate": ""
  }
]
